In [2]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='localhost', port=5432, dbname='dvdrental', user='postgres', password='admin')

df = pd.read_sql('select * from city',con=connection)
print(df)

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2285440373.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('select * from city',con=connection)

In [3]:
from sqlalchemy import create_engine

db_string = "postgresql://postgres:admin@localhost:5432/dvdrental"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

1. Ile kategorii filmów mamy w wypożyczalni?

In [5]:
df = pd.read_sql('SELECT count(distinct category) FROM film_list',con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/3120313637.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('SELECT count(distinct category) FROM film_list',con=connection)

   count
0     16

2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [7]:
df = pd.read_sql('SELECT DISTINCT category FROM film_list ORDER BY category',con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/3909861505.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('SELECT DISTINCT category FROM film_list ORDER BY category',con=connection)

       category
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [8]:
df_young = pd.read_sql('SELECT * FROM film ORDER BY release_year LIMIT 1',con=connection)
df_old = pd.read_sql('SELECT * FROM film ORDER BY release_year DESC LIMIT 1',con=connection)
print(df_young)
print("\n")
print(df_old)

   film_id            title  \
0      133  Chamber Italian

                                         description  release_year  \
0  A Fateful Reflection of a Moose And a Husband ...          2006

   language_id  rental_duration  rental_rate  length  replacement_cost rating  \
0            1                7         4.99     117             14.99  NC-17

              last_update special_features  \
0 2013-05-26 14:50:58.951       [Trailers]

                                            fulltext
0  'chamber':1 'fate':4 'husband':11 'italian':2 ...


   film_id            title  \
0      133  Chamber Italian

                                         description  release_year  \
0  A Fateful Reflection of a Moose And a Husband ...          2006

   language_id  rental_duration  rental_rate  length  replacement_cost rating  \
0            1                7         4.99     117             14.99  NC-17

              last_update special_features  \
0 2013-05-26 14:50:58.951       [Trailers]

                                            fulltext
0  'chamber':1 'fate':4 'husband':11 'italian':2 ...

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/3626838718.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_young = pd.read_sql('SELECT * FROM film ORDER BY release_year LIMIT 1',con=connection)
C:\Users\patry\AppData\Local\Temp/ipykernel_1620/3626838718.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_old = pd.read_sql('SELECT * FROM film ORDER BY release_year DESC LIMIT 1',con=connection)

4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [9]:
df = pd.read_sql_query("select count(*) from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/3662326745.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select count(*) from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)

   count
0   7380

5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [10]:
df = pd.read_sql_query("select count(*) from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2899334928.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select count(*) from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)

   count
0      0

6. Znajdź największą płatność wypożyczenia.

In [11]:
df = pd.read_sql('SELECT * FROM payment ORDER BY amount DESC LIMIT 1',con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/127453672.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('SELECT * FROM payment ORDER BY amount DESC LIMIT 1',con=connection)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577

7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [12]:
df = pd.read_sql("SELECT name, country FROM customer_list WHERE country = 'poland' or country = 'Nigeria' or country = 'Bangladesh'",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2774341756.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT name, country FROM customer_list WHERE country = 'poland' or country = 'Nigeria' or country = 'Bangladesh'",con=connection)

               name     country
0     Sonia Gregory     Nigeria
1    Rodney Moeller     Nigeria
2    Stephen Qualls  Bangladesh
3       Velma Lucas     Nigeria
4      Marilyn Ross     Nigeria
5      Elsie Kelley     Nigeria
6   Gladys Hamilton     Nigeria
7    Frank Waggoner  Bangladesh
8      Carol Garcia     Nigeria
9      Olga Jimenez     Nigeria
10  Bertha Ferguson     Nigeria
11   Tracey Barrett     Nigeria
12        Jo Fowler     Nigeria
13    Wallace Slone     Nigeria
14   Michelle Clark  Bangladesh
15   Constance Reid     Nigeria

8. Gdzie mieszkają członkowie personelu?

In [13]:
df = pd.read_sql_query("select name, city, country from staff_list",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2622611372.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select name, city, country from staff_list",con=connection)

           name        city    country
0  Mike Hillyer  Lethbridge     Canada
1  Jon Stephens   Woodridge  Australia

9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [14]:
df = pd.read_sql("SELECT count(*) FROM staff_list WHERE country = 'Argentyna' or country = 'Spain'",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2618561980.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT count(*) FROM staff_list WHERE country = 'Argentyna' or country = 'Spain'",con=connection)

   count
0      0

10. Jakie kategorie filmów zostały wypożyczone przez klientów?

In [15]:
df = pd.read_sql_query("select category from sales_by_film_category where total_sales > 0",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/382800214.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select category from sales_by_film_category where total_sales > 0",con=connection)

       category
0        Sports
1        Sci-Fi
2     Animation
3         Drama
4        Comedy
5           New
6        Action
7       Foreign
8         Games
9        Family
10  Documentary
11       Horror
12     Classics
13     Children
14       Travel
15        Music

11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [16]:
df = pd.read_sql_query("""
select distinct category from film_list where fid in (
    select film_id from inventory where inventory_id in (
        select inventory_id from rental where customer_id in (
            select id from customer_list where country = 'United States'
        )
    )
)""",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/2569162966.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("""

       category
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [17]:
df = pd.read_sql("SELECT title FROM film_list WHERE actors like '%Olympia Pfeiffer%' or actors like '%Julia Zellweger%' or actors like '%Ellen Presley%'",con=connection)
df

C:\Users\patry\AppData\Local\Temp/ipykernel_1620/75188246.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT title FROM film_list WHERE actors like '%Olympia Pfeiffer%' or actors like '%Julia Zellweger%' or actors like '%Ellen Presley%'",con=connection)

                   title
0       Titanic Boondock
1           Women Dorado
2      Caribbean Liberty
3       Cranes Reservoir
4            Sense Greek
..                   ...
64       Jeopardy Encino
65  Streetcar Intentions
66      Effect Gladiator
67      Treasure Command
68       Hollow Jeopardy

[69 rows x 1 columns]